In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
s1 = pd.Series(np.random.rand(4), index=['a', 'b', 'c', 'd'])

In [4]:
s1

a    0.532765
b    0.560674
c    0.914477
d    0.479262
dtype: float64

In [5]:
s2 = pd.Series(np.random.rand(4))

In [6]:
s2

0    0.431981
1    0.916976
2    0.364108
3    0.185037
dtype: float64

In [7]:
s1['c']

0.91447686150371821

In [8]:
s1['c'] = 3.14
s1

a    0.532765
b    0.560674
c    3.140000
d    0.479262
dtype: float64

In [9]:
s1[['c','a', 'b']]

c    3.140000
a    0.532765
b    0.560674
dtype: float64

In [10]:
s3 = pd.Series({'001': 'Nam', '002': 'Mary', '003': 'Peter'})

In [11]:
s3

001      Nam
002     Mary
003    Peter
dtype: object

In [12]:
s4 = pd.Series({'001': 'Nam', '002': 'Mary',
                    '003': 'Peter'}, index=[
                    '002', '001', '024', '065'])

In [13]:
s4

002    Mary
001     Nam
024     NaN
065     NaN
dtype: object

In [14]:
pd.isnull(s4)

002    False
001    False
024     True
065     True
dtype: bool

In [15]:
s5 = pd.Series(2.71, index=['x', 'y'])

In [16]:
s5

x    2.71
y    2.71
dtype: float64

In [17]:
s6 = pd.Series(np.array([2.71, 3.14]), index=['z', 'y'])

In [18]:
s6

z    2.71
y    3.14
dtype: float64

In [19]:
s5 + s6

x     NaN
y    5.85
z     NaN
dtype: float64

In [20]:
data = {'Year': [2000, 2005, 2010, 2014],
         'Median_Age': [24.2, 26.4, 28.5, 30.3],
         'Density': [244, 256, 268, 279]}

In [21]:
s7 = pd.Series(data)

In [22]:
s7

Density           [244, 256, 268, 279]
Median_Age    [24.2, 26.4, 28.5, 30.3]
Year          [2000, 2005, 2010, 2014]
dtype: object

In [23]:
df1 = pd.DataFrame(data)

In [24]:
df1

   Density  Median_Age  Year
0      244        24.2  2000
1      256        26.4  2005
2      268        28.5  2010
3      279        30.3  2014

In [25]:
df2 = pd.DataFrame(data, columns=['Year', 'Density', 'Median_Age'])

In [26]:
df2

   Year  Density  Median_Age
0  2000      244        24.2
1  2005      256        26.4
2  2010      268        28.5
3  2014      279        30.3

In [27]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
df3 = pd.DataFrame(data, columns=['Year', 'Density', 'Median_Age'], index=['a', 'b', 'c', 'd'])

In [29]:
df3

   Year  Density  Median_Age
a  2000      244        24.2
b  2005      256        26.4
c  2010      268        28.5
d  2014      279        30.3

In [30]:
df4 = pd.DataFrame([
    ['Peter', 16, 'pupil', 'TN', 'M', None],
    ['Mary', 21, 'student', 'SG', 'F', None],
    ['Nam', 22, 'student', 'HN', 'M', None],
    ['Mai', 31, 'nurse', 'SG', 'F', None],
    ['John', 28, 'laywer', 'SG', 'M', None]],
    columns=['name', 'age', 'career', 'province', 'sex', 'award'])

In [31]:
df4

    name  age   career province sex award
0  Peter   16    pupil       TN   M  None
1   Mary   21  student       SG   F  None
2    Nam   22  student       HN   M  None
3    Mai   31    nurse       SG   F  None
4   John   28   laywer       SG   M  None

In [32]:
df4.name

0    Peter
1     Mary
2      Nam
3      Mai
4     John
Name: name, dtype: object

In [33]:
df4['award'] = None

In [34]:
df4

    name  age   career province sex award
0  Peter   16    pupil       TN   M  None
1   Mary   21  student       SG   F  None
2    Nam   22  student       HN   M  None
3    Mai   31    nurse       SG   F  None
4   John   28   laywer       SG   M  None

In [35]:
df4.ix[1]

/Users/jason/anaconda/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

name           Mary
age              21
career      student
province         SG
sex               F
award          None
Name: 1, dtype: object

In [36]:
df4 = pd.read_csv('person.csv')

In [37]:
df4

    name  age   career province sex
0  Peter   16    pupil       TN   M
1   Mary   21  student       SG   F
2    Nam   22  student       HN   M
3    Mai   31    nurse       SG   F
4   John   28   lawyer       SG   M

In [38]:
s2

0    0.431981
1    0.916976
2    0.364108
3    0.185037
dtype: float64

In [39]:
s2.reindex([0,2,'b',3])

0    0.431981
2    0.364108
b         NaN
3    0.185037
dtype: float64

In [40]:
df1

   Density  Median_Age  Year
0      244        24.2  2000
1      256        26.4  2005
2      268        28.5  2010
3      279        30.3  2014

In [41]:
df1.reindex(index=[0, 2, 'b', 3], columns=['Density', 'Year', 'Median_Age','C'])

   Density    Year  Median_Age   C
0    244.0  2000.0        24.2 NaN
2    268.0  2010.0        28.5 NaN
b      NaN     NaN         NaN NaN
3    279.0  2014.0        30.3 NaN

In [42]:
s7 = pd.Series(np.random.rand(10000))

In [43]:
s7.head()

0    0.964711
1    0.414608
2    0.593639
3    0.816922
4    0.893063
dtype: float64

In [44]:
s7.tail()

9995    0.910816
9996    0.624114
9997    0.901831
9998    0.848288
9999    0.705013
dtype: float64

In [45]:
df5 = pd.DataFrame(np.arange(9).reshape(3,3), columns=['a','b','c'])

In [46]:
df5

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [47]:
df6 = pd.DataFrame(np.arange(8).reshape(2,4), columns=['a','b','c','d'])

In [48]:
df6

   a  b  c  d
0  0  1  2  3
1  4  5  6  7

In [49]:
df5 + df6

     a    b     c   d
0  0.0  2.0   4.0 NaN
1  7.0  9.0  11.0 NaN
2  NaN  NaN   NaN NaN

In [50]:
df7 = df5.add(df6, fill_value=0)

In [51]:
df7

     a    b     c    d
0  0.0  2.0   4.0  3.0
1  7.0  9.0  11.0  7.0
2  6.0  7.0   8.0  NaN

In [52]:
df5.eq(df6)

       a      b      c      d
0   True   True   True  False
1  False  False  False  False
2  False  False  False  False

In [53]:
df5

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [54]:
df5.sum()

a     9
b    12
c    15
dtype: int64

In [55]:
df5.describe()

         a    b    c
count  3.0  3.0  3.0
mean   3.0  4.0  5.0
std    3.0  3.0  3.0
min    0.0  1.0  2.0
25%    1.5  2.5  3.5
50%    3.0  4.0  5.0
75%    4.5  5.5  6.5
max    6.0  7.0  8.0

In [56]:
df5.describe(percentiles=[0.5, 0.8])

         a    b    c
count  3.0  3.0  3.0
mean   3.0  4.0  5.0
std    3.0  3.0  3.0
min    0.0  1.0  2.0
50%    3.0  4.0  5.0
80%    4.8  5.8  6.8
max    6.0  7.0  8.0

In [57]:
df5.idxmin()

a    0
b    0
c    0
dtype: int64

In [58]:
df5.idxmax()

a    2
b    2
c    2
dtype: int64

In [59]:
df5.min()

a    0
b    1
c    2
dtype: int64

In [60]:
df5.max()

a    6
b    7
c    8
dtype: int64

In [61]:
df5.mean()

a    3.0
b    4.0
c    5.0
dtype: float64

In [62]:
df5.count()

a    3
b    3
c    3
dtype: int64

In [63]:
f = lambda x: x.max() - x.min()

In [64]:
df5

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [65]:
df5.apply(f, axis=1)

0    2
1    2
2    2
dtype: int64

In [109]:
df5.apply(f, axis=0)

a    6
b    6
c    6
dtype: int64

In [66]:
def sigmoid(x):
    return 1/(1 + np.exp(x))

In [67]:
df5.apply(sigmoid)

          a         b         c
0  0.500000  0.268941  0.119203
1  0.047426  0.017986  0.006693
2  0.002473  0.000911  0.000335

In [68]:
df7 = pd.DataFrame(np.arange(12).reshape(3,4),  
                       columns=['b', 'd', 'a', 'c'],
                       index=['x', 'y', 'z'])

In [69]:
df7

   b  d   a   c
x  0  1   2   3
y  4  5   6   7
z  8  9  10  11

In [70]:
df7.sort_index(axis=1)

    a  b   c  d
x   2  0   3  1
y   6  4   7  5
z  10  8  11  9

In [110]:
df7.sort_index(axis=0)

   b  d   a   c
x  0  1   2   3
y  4  5   6   7
z  8  9  10  11

In [71]:
s4

002    Mary
001     Nam
024     NaN
065     NaN
dtype: object

In [72]:
s4.sort_values(na_position='first')

024     NaN
065     NaN
002    Mary
001     Nam
dtype: object

In [73]:
df7

   b  d   a   c
x  0  1   2   3
y  4  5   6   7
z  8  9  10  11

In [74]:
df7.sort_values(['b','d'],ascending=False)

   b  d   a   c
z  8  9  10  11
y  4  5   6   7
x  0  1   2   3

In [75]:
s4[['024', '002']]

024     NaN
002    Mary
dtype: object

In [76]:
s4[['024', '002']] = 'unknown'

In [77]:
s4

002    unknown
001        Nam
024    unknown
065        NaN
dtype: object

In [78]:
df5

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [79]:
df5[['b','c']]

   b  c
0  1  2
1  4  5
2  7  8

In [80]:
df5.ix[0]

/Users/jason/anaconda/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

a    0
b    1
c    2
Name: 0, dtype: int64

In [81]:
df5.ix[0, 1:3]

b    1
c    2
Name: 0, dtype: int64

In [82]:
df5.iloc[0]

a    0
b    1
c    2
Name: 0, dtype: int64

In [83]:
df8 = pd.DataFrame(np.arange(12).reshape(4,3),  
                       columns=['a', 'b', 'c'])

In [84]:
df8

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [85]:
df9 = df8.reindex(columns = ['a', 'b', 'c', 'd'])

In [86]:
df9

   a   b   c   d
0  0   1   2 NaN
1  3   4   5 NaN
2  6   7   8 NaN
3  9  10  11 NaN

In [87]:
df10 = df8.reindex([3, 2, 'a', 0])

In [88]:
df10

     a     b     c
3  9.0  10.0  11.0
2  6.0   7.0   8.0
a  NaN   NaN   NaN
0  0.0   1.0   2.0

In [89]:
df10.isnull()

       a      b      c
3  False  False  False
2  False  False  False
a   True   True   True
0  False  False  False

In [90]:
s4 = pd.Series({'001': 'Nam', '002': 'Mary',
                    '003': 'Peter'},
                    index=['002', '001', '024', '065'])

In [91]:
s4

002    Mary
001     Nam
024     NaN
065     NaN
dtype: object

In [92]:
s4.dropna()

002    Mary
001     Nam
dtype: object

In [93]:
df9

   a   b   c   d
0  0   1   2 NaN
1  3   4   5 NaN
2  6   7   8 NaN
3  9  10  11 NaN

In [94]:
df9.dropna(axis=1)

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [95]:
df11 = df8.reindex([3, 2, 'a', 0], fill_value = 0)

In [96]:
df11

   a   b   c
3  9  10  11
2  6   7   8
a  0   0   0
0  0   1   2

In [97]:
df9.fillna(-1)

   a   b   c    d
0  0   1   2 -1.0
1  3   4   5 -1.0
2  6   7   8 -1.0
3  9  10  11 -1.0

In [98]:
s8 = pd.Series(np.random.rand(8), index=[['a','a','b','b','c','c', 'd','d'], [0, 1, 0, 1, 0,1, 0, 1, ]])

In [99]:
s8

a  0    0.578463
   1    0.102355
b  0    0.422342
   1    0.430046
c  0    0.377667
   1    0.058606
d  0    0.525143
   1    0.765237
dtype: float64

In [100]:
s8.unstack()

          0         1
a  0.578463  0.102355
b  0.422342  0.430046
c  0.377667  0.058606
d  0.525143  0.765237

In [101]:
s8['a']

0    0.578463
1    0.102355
dtype: float64

In [102]:
df = pd.DataFrame(np.random.rand(12).reshape(4,3), index=[['a', 'a', 'b', 'b'], [0, 1, 0, 1]],
                      columns=[['x', 'x', 'y'], [0, 1, 0]])

In [103]:
df

            x                   y
            0         1         0
a 0  0.030947  0.001227  0.848846
  1  0.536633  0.991775  0.226398
b 0  0.363173  0.998170  0.484811
  1  0.565101  0.463029  0.287526

In [104]:
df.index

MultiIndex(levels=[['a', 'b'], [0, 1]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [105]:
df.columns

MultiIndex(levels=[['x', 'y'], [0, 1]],
           labels=[[0, 0, 1], [0, 1, 0]])

In [106]:
df['x']

            0         1
a 0  0.030947  0.001227
  1  0.536633  0.991775
b 0  0.363173  0.998170
  1  0.565101  0.463029

In [107]:
df.ix[['a','b']]

/Users/jason/anaconda/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

            x                   y
            0         1         0
a 0  0.030947  0.001227  0.848846
  1  0.536633  0.991775  0.226398
b 0  0.363173  0.998170  0.484811
  1  0.565101  0.463029  0.287526

In [108]:
df.ix[['a','b']].ix[3]

/Users/jason/anaconda/lib/python3.6/site-packages/ipykernel/__main__.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  if __name__ == '__main__':

x  0    0.565101
   1    0.463029
y  0    0.287526
Name: (b, 1), dtype: float64